In [1]:
import pandas as pd

In [2]:
df = pd.read_parquet(r'D:\daneshkar\pandas-numpy-matplotlib\x\final_datasets\raw_tennis_power_parquet_all_days.parquet') 
df

        match_id  set_num  game_num  value  break_occurred
0       11998445        1         1 -52.80           False
1       11998445        1         2  48.14           False
2       11998445        1         3 -51.62           False
3       11998445        1         4  10.00           False
4       11998445        1         5  26.60            True
...          ...      ...       ...    ...             ...
469672  12213803        2         3 -10.00           False
469673  12213803        2         4  10.00           False
469674  12213803        2         5  10.00            True
469675  12213803        2         6  10.00           False
469676  12213803        2         7  28.60            True

[469677 rows x 5 columns]

In [11]:
away_team = pd.read_parquet(r'D:\daneshkar\pandas-numpy-matplotlib\x\final_datasets\raw_match\away_team_all_days.parquet')
away_team

,match_id,name,slug,gender,user_count,residence,birthplace,height,weight,plays,...,period_2,period_3,period_4,period_5,period_1_tie_break,period_2_tie_break,period_3_tie_break,period_4_tie_break,period_5_tie_break,normal_time
0,11998445,Auger-Aliassime F.,auger-aliassime-felix,M,23318.0,"Monte Carlo, Monaco","Montreal, Canada",1.93,87.0,right-handed,...,NaN,NaN,None,None,NaN,NaN,NaN,None,None,None
1,11998446,Cobolli F.,flavio-cobolli,M,5995.0,Rome,"Florence, Italy",1.83,71.0,right-handed,...,NaN,NaN,None,None,NaN,NaN,NaN,None,None,None
2,11998447,Martínez P.,martinez-pedro,M,2621.0,"Valencia, Spain","Alzira, Spain",1.85,76.0,right-handed,...,NaN,NaN,None,None,NaN,NaN,NaN,None,None,None
3,11998448,Muller A.,muller-alexandre,M,2443.0,France,"Poissy, France",1.83,73.0,right-handed,...,NaN,NaN,None,None,NaN,NaN,NaN,None,None,None
4,11998449,Mayot H.,mayot-harold,M,1492.0,"Marly, France","Metz, France",1.78,78.0,right-handed,...,NaN,NaN,None,None,NaN,NaN,NaN,None,None,None
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
59251,12213482,None,None,None,NaN,None,None,NaN,NaN,None,...,4.0,NaN,None,None,NaN,NaN,NaN,None,None,None
59252,12213483,None,None,None,NaN,None,None,NaN,NaN,None,...,4.0,NaN,None,None,NaN,NaN,NaN,None,None,None
59253,12213484,None,None,None,NaN,None,None,NaN,NaN,None,...,3.0,NaN,None,None,NaN,NaN,NaN,None,None,None
59254,12213486,None,None,None,NaN,None,None,NaN,NaN,None,...,4.0,NaN,None,None,NaN,NaN,NaN,None,None,None
59255,12213803,None,None,None,NaN,None,None,NaN,NaN,None,...,1.0,NaN,None,None,NaN,NaN,NaN,None,None,None

In [13]:
away_filter = away_team[['match_id' , 'gender']]
away_filter

       match_id gender
0      11998445      M
1      11998446      M
2      11998447      M
3      11998448      M
4      11998449      M
...         ...    ...
59251  12213482   None
59252  12213483   None
59253  12213484   None
59254  12213486   None
59255  12213803   None

[59256 rows x 2 columns]

In [15]:
away_drop = away_filter.dropna()
away_drop

       match_id gender
0      11998445      M
1      11998446      M
2      11998447      M
3      11998448      M
4      11998449      M
...         ...    ...
58500  12212216      M
58501  12213156      M
58502  12213412      M
58503  12213458      M
58504  12213459      M

[24170 rows x 2 columns]

In [35]:
identity_number = df[['match_id' , 'set_num' ,'game_num']]
identity_number.dropna()
identity_number

        match_id  set_num  game_num
0       11998445        1         1
1       11998445        1         2
2       11998445        1         3
3       11998445        1         4
4       11998445        1         5
...          ...      ...       ...
469672  12213803        2         3
469673  12213803        2         4
469674  12213803        2         5
469675  12213803        2         6
469676  12213803        2         7

[469677 rows x 3 columns]

In [36]:
merged = pd.merge(away_drop , identity_number , on= 'match_id')
merged

        match_id gender  set_num  game_num
0       11998445      M        1         1
1       11998445      M        1         2
2       11998445      M        1         3
3       11998445      M        1         4
4       11998445      M        1         5
...          ...    ...      ...       ...
876139  12213459      M        2         5
876140  12213459      M        2         6
876141  12213459      M        2         7
876142  12213459      M        2         8
876143  12213459      M        2         9

[876144 rows x 4 columns]

In [39]:
merged_men = merged[merged['gender'] == 'M']
merged_women = merged[merged['gender'] == 'F']

In [43]:
merged_men['game_num'].mean()

np.float64(5.440241258219356)

In [44]:
merged_women['game_num'].mean()

np.float64(5.247272330917216)